#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-SOAT-8-G6/gh-actions/runs/run-piACpXWJ7W1zXMSt

Waiting for the plan to start...

Terraform v1.10.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.vpc: Refreshing...
data.aws_iam_role.labrole: Refreshing...
data.aws_iam_role.labrole: Refresh complete after 1s [id=LabRole]
data.aws_vpc.vpc: Refresh complete after 1s [id=vpc-055557575bcb498e7]
data.aws_subnets.subnets: Refreshing...
aws_security_group.sg: Refreshing state... [id=sg-057fada4254c1f0b7]
data.aws_subnets.subnets: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0eadffb70e2d1e565"]: Refreshing...
data.aws_subnet.subnet["subnet-0e476ff8557a8c893"]: Refreshing...
data.aws_subnet.subnet["subnet-037ebaeafdcc11430"]: Refreshing...
data.aws_subnet.subnet["subnet-06238683b1db68be5"]: Refreshing...
data.aws_subnet.subnet["subnet-013512bf3936fb64a"]: Refreshing...
data.aws_subnet.subnet["subnet-070894f1967527a98"]: Refreshing...
data.aws_subnet.subnet["subnet-0eadffb70e2d1e565"]: Refresh complete after 0s [id=subnet-0eadffb70e2d1e565]
data.aws_subnet.subnet["subnet-037ebaeafdcc11430"]: Refresh complete after 0s [id=subnet-037ebaeafdcc11430]
data.aws_subnet.subnet["subnet-070894f1967527a98"]: Refresh complete after 0s [id=subnet-070894f1967527a98]
data.aws_subnet.subnet["subnet-06238683b1db68be5"]: Refresh complete after 0s [id=subnet-06238683b1db68be5]
data.aws_subnet.subnet["subnet-013512bf3936fb64a"]: Refresh complete after 0s [id=subnet-013512bf3936fb64a]
data.aws_subnet.subnet["subnet-0e476ff8557a8c893"]: Refresh complete after 0s [id=subnet-0e476ff8557a8c893]
aws_security_group.sg: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "tech-challenge-lanchonete"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::590183731131:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-057fada4254c1f0b7",
            ]
          + subnet_ids                = [
              + "subnet-037ebaeafdcc11430",
              + "subnet-06238683b1db68be5",
              + "subnet-070894f1967527a98",
              + "subnet-0e476ff8557a8c893",
              + "subnet-0eadffb70e2d1e565",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech-challenge-lanchonete"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.small",
        ]
      + node_group_name        = "NG-tech-challenge-lanchonete"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::590183731131:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-037ebaeafdcc11430",
          + "subnet-06238683b1db68be5",
          + "subnet-070894f1967527a98",
          + "subnet-0e476ff8557a8c893",
          + "subnet-0eadffb70e2d1e565",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vitorrafael, Action: `pull_request`*